Aggregating and Grouping

In [112]:
import pandas as pd

In [113]:
df = pd.read_csv("car.csv")
schema_df = pd.read_csv("car.csv")

In [114]:
pd.set_option('display.max_columns',12)
pd.set_option('display.max_rows',85)

In [115]:
df.head()

,name,year,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats,selling_price
0,BMW,2014,145500,Diesel,Individual,Manual,First Owner,23.40,1248.0,74.00,5.0,450000
1,Honda,2014,120000,Diesel,Individual,Manual,Second Owner,21.14,1498.0,103.52,5.0,370000
2,Toyota,2006,140000,Petrol,Individual,Manual,Third Owner,17.70,1497.0,78.00,5.0,158000
3,Ford,2010,127000,Diesel,Individual,Manual,First Owner,23.00,1396.0,90.00,5.0,225000
4,Honda,2007,120000,Petrol,Individual,Manual,First Owner,16.10,1298.0,88.20,5.0,130000

In [116]:
df['km_driven'].median()

60000.0

In [117]:
df.median()

C:\Users\DELL\AppData\Local\Temp\ipykernel_4120\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

year               2015.0
km_driven         60000.0
mileage              19.3
engine             1248.0
max_power            82.0
seats                 5.0
selling_price    450000.0
dtype: float64

In [118]:
df.describe()

,year,km_driven,mileage,engine,max_power,seats,selling_price
count,8128.000000,8.128000e+03,7907.000000,7907.000000,7912.000000,7907.000000,8.128000e+03
mean,2013.804011,6.981951e+04,19.418783,1458.625016,91.517919,5.416719,6.382718e+05
std,4.044249,5.655055e+04,4.037145,503.916303,35.822499,0.959588,8.062534e+05
min,1983.000000,1.000000e+00,0.000000,624.000000,0.000000,2.000000,2.999900e+04
25%,2011.000000,3.500000e+04,16.780000,1197.000000,68.050000,5.000000,2.549990e+05
50%,2015.000000,6.000000e+04,19.300000,1248.000000,82.000000,5.000000,4.500000e+05
75%,2017.000000,9.800000e+04,22.320000,1582.000000,102.000000,5.000000,6.750000e+05
max,2020.000000,2.360457e+06,42.000000,3604.000000,400.000000,14.000000,1.000000e+07

In [119]:
df['km_driven'].count()

8128

In [120]:
df.groupby('transmission')

In [121]:
trans_grp = df.groupby(['transmission'])

In [122]:
trans_grp.get_group('Automatic')

,name,year,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats,selling_price
41,Nissan,2019,5000,Petrol,Individual,Automatic,First Owner,16.00,1368.0,160.77,5.0,2100000
44,Toyota,2018,23300,Petrol,Dealer,Automatic,First Owner,18.50,1197.0,83.14,5.0,675000
49,Honda,2014,27800,Diesel,Dealer,Automatic,Second Owner,14.80,2143.0,120.70,5.0,1450000
55,Ford,2016,127700,Diesel,Dealer,Automatic,Second Owner,11.36,2755.0,171.50,7.0,1650000
57,Honda,2013,33900,Diesel,Dealer,Automatic,Second Owner,17.68,1968.0,174.33,5.0,1750000
...,...,...,...,...,...,...,...,...,...,...,...,...
8058,Ford,2017,8000,Petrol,Dealer,Automatic,First Owner,16.60,1798.0,177.50,5.0,1689999
8063,BMW,2016,40000,Petrol,Dealer,Automatic,First Owner,14.80,1591.0,121.30,5.0,890000
8081,BMW,2005,100000,Petrol,Individual,Automatic,Second Owner,12.00,1493.0,100.00,5.0,110000
8086,BMW,2018,30000,Petrol,Individual,Automatic,First Owner,23.10,998.0,67.04,5.0,470000
8108,Honda,2019,20000,Diesel,Individual,Automatic,First Owner,17.80,1493.0,113.40,5.0,1575000

In [123]:
filt = df['transmission'] == 'Automatic'
df.loc[filt]
df.loc[filt]['seller_type'].value_counts()

Individual          492
Dealer              459
Trustmark Dealer     99
Name: seller_type, dtype: int64

In [124]:
trans_grp['seller_type'].value_counts(normalize=True).loc['Manual']

seller_type
Individual          0.886409
Dealer              0.094236
Trustmark Dealer    0.019356
Name: seller_type, dtype: float64

In [125]:
trans_grp['seats'].agg(['median','mean'])

              median      mean
transmission
Automatic        5.0  5.237272
Manual           5.0  5.443927

In [126]:
trans_grp['name'].apply(lambda x : x.str.contains('BMW').sum())

transmission
Automatic     188
Manual       1360
Name: name, dtype: int64

Cleaning Data

In [127]:
import pandas as pd
import numpy as np

In [128]:
people = {
    "first" : ["corey","John","Jone","chris",np.nan,None,"Na"],
    "last" : ["Schafer","Doe","Doe","Schafer",np.nan,np.nan,"Missing"],
    "email" : ["CoreySchafer@gmail.com","JohnDoe@gmail.com","JoneDoe@gmail.com",None,np.nan,"anoy@gmail.com","Na"],
    "age" : ["33","35","63","36",None,None,"Missing"]
}

In [129]:
df = pd.DataFrame(people)

In [130]:
df

   first     last                   email      age
0  corey  Schafer  CoreySchafer@gmail.com       33
1   John      Doe       JohnDoe@gmail.com       35
2   Jone      Doe       JoneDoe@gmail.com       63
3  chris  Schafer                    None       36
4    NaN      NaN                     NaN     None
5   None      NaN          anoy@gmail.com     None
6     Na  Missing                      Na  Missing

In [131]:
df.dropna() #remove rows or cols have null values

   first     last                   email      age
0  corey  Schafer  CoreySchafer@gmail.com       33
1   John      Doe       JohnDoe@gmail.com       35
2   Jone      Doe       JoneDoe@gmail.com       63
6     Na  Missing                      Na  Missing

In [132]:
df.dropna(axis='rows',how='any')#يقوم بإزالة أي صف يحتوي على قيمة مفقودة واحدة على الأقل في أي من الأعمدة.

   first     last                   email      age
0  corey  Schafer  CoreySchafer@gmail.com       33
1   John      Doe       JohnDoe@gmail.com       35
2   Jone      Doe       JoneDoe@gmail.com       63
6     Na  Missing                      Na  Missing

In [133]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [134]:
df.dropna(axis='index' , how='all' , subset=['email']) #subset = بحدد العمود اللى هحذف منه الصف لو يحتوى على قيمة null

   first     last                   email      age
0  corey  Schafer  CoreySchafer@gmail.com       33
1   John      Doe       JohnDoe@gmail.com       35
2   Jone      Doe       JoneDoe@gmail.com       63
5   None      NaN          anoy@gmail.com     None
6     Na  Missing                      Na  Missing

In [135]:
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6  False  False  False  False

In [136]:
df.fillna("MISSING")

     first     last                   email      age
0    corey  Schafer  CoreySchafer@gmail.com       33
1     John      Doe       JohnDoe@gmail.com       35
2     Jone      Doe       JoneDoe@gmail.com       63
3    chris  Schafer                 MISSING       36
4  MISSING  MISSING                 MISSING  MISSING
5  MISSING  MISSING          anoy@gmail.com  MISSING
6       Na  Missing                      Na  Missing

In [137]:
df.dtypes

first    object
last     object
email    object
age      object
dtype: object

In [140]:
df['age'].replace('Missing',51,inplace=True)
df['age'].replace('MISSING',21,inplace=True)

In [141]:
df['age'] = df['age'].astype(float)

In [142]:
df['age'].mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of 0    33.0
1    35.0
2    63.0
3    36.0
4     NaN
5     NaN
6    51.0
Name: age, dtype: float64>

Working with Dates and Times Saries Data

In [144]:
import pandas as pd

In [146]:
df = pd.read_csv('car.csv')

In [147]:
df.head()

,name,year,km_driven,fuel,seller_type,transmission,owner,mileage,engine,max_power,seats,selling_price
0,BMW,2014,145500,Diesel,Individual,Manual,First Owner,23.40,1248.0,74.00,5.0,450000
1,Honda,2014,120000,Diesel,Individual,Manual,Second Owner,21.14,1498.0,103.52,5.0,370000
2,Toyota,2006,140000,Petrol,Individual,Manual,Third Owner,17.70,1497.0,78.00,5.0,158000
3,Ford,2010,127000,Diesel,Individual,Manual,First Owner,23.00,1396.0,90.00,5.0,225000
4,Honda,2007,120000,Petrol,Individual,Manual,First Owner,16.10,1298.0,88.20,5.0,130000

In [149]:
df.shape

(8128, 12)

Reading/Write Data

In [ ]:
#df = pd.read_csv('car.csv') #Read CSV
#india_df.to_csv('car.csv') #Write CSV
#india_df.to_csv('car.tsv',sep='\t') #Write TSV
#india_df.to_excel('car.xlsx') #Write excel
#test = pd.read_excel('car.xlsx',index_col='Respondent') #Read excel
#india_df.to_json('car.json') #Write json
#test = pd.read_json('car.json',index_col='Respondent') #Read JSON